//
class zi {
    constructor(zifu, strokes, base, code, desc, imageSrc) {
        this.zifu = zifu;
        this.strokes = strokes;
        this.base = base;
        this.code = code;
        this.desc = desc;
        this.imageSrc = imageSrc;
    }
}
//code: #A05
//digit 1: #A basic changes
//digit 2: H means heavier, L means lighter
var hanziGroupList = [
    [
        new zi("的", 8, "的", "#AL", "a", "/"),
        new zi("勹", 2, "的", "#A0", "a", "/"),
    ],
    [
        new zi("得", 11, "得", "#AL", "a", "/"),
        new zi("丿", 1, "得", "#A0", "a", "/"),
    ],
    [
        new zi("地", 6, "地", "#AL", "a", "/"),
        new zi("乚", 1, "地", "#A0", "a", "/"),
    ],
    [
        new zi("大", 3, "大", "#0H", "a", "/"),
        new zi("眔", 10, "大", "#0H", "a", "/"),
    ],
    [
        new zi("小", 3, "小", "#0H", "a", "/"),
        new zi("皛", 15, "小", "#0H", "a", "/"),
    ],
    [
        new zi("心", 3, "心", "#0H", "a", "/"),
        new zi("杺", 13, "心", "#00", "a", "/"),
    ],
    [
        new zi("就", 12, "就", "#0L", "a", "/"),
        new zi("丩", 2, "就", "#00", "a", "/"),
    ],
    [
        new zi("無", 12, "無", "#0L", "a", "/"),
        new zi("无", 4, "無", "#00", "a", "/"),
    ],
    [
        new zi("土", 3, "土", "#00", "a", "/"),
        new zi("嵞", 13, "土", "#00", "a", "/"),
    ],
    [
        new zi("會", 3, "會", "#00", "a", "/"),
        new zi("亽", 3, "會", "#00", "a", "/"),
        new zi("会", 13, "會", "#00", "a", "/"),
    ],
    [
        new zi("其", 8, "其", "#00", "a", "/"),
        new zi("丌", 3, "其", "#00", "a", "/"),
    ],
    [
        new zi("着", 11, "着", "#00", "a", "/"),
        new zi("丆", 2, "着", "#00", "a", "/"),
    ],
    [
        new zi("有", 6, "有", "#00", "a", "/"),
        new zi("屮", 3, "有", "#00", "a", "/"),
    ],
    [
        new zi("到", 8, "到", "#00", "a", "/"),
        new zi("ㄥ", 3, "到", "#00", "a", "/"),
    ],
    [
        new zi("我", 7, "我", "#00", "a", "/"),
        new zi("ㄙ", 2, "我", "#00", "a", "/"),
    ],
    [
        new zi("卻", 9, "卻", "#00", "a", "/"),
        new zi("ㄗ", 2, "卻", "#00", "a", "/"),
    ],
    [
        new zi("然", 12, "然", "#00", "a", "/"),
        new zi("彡", 3, "然", "#00", "a", "/"),
    ],
    [
        new zi("是", 9, "是", "#00", "a", "/"),
        new zi("乥", 4, "是", "#00", "a", "/"),
    ],
    [
        new zi("之", 2, "之", "#00", "a", "/"),
        new zi("臸", 12, "之", "#00", "a", "/"),
    ],
    [
        new zi("力", 2, "力", "#00", "a", "/"),
        new zi("攭", 24, "力", "#00", "a", "/"),
    ],
    [
        new zi("最", 12, "最", "#00", "a", "/"),
        new zi("冃", 4, "最", "#00", "a", "/"),
    ],
    [
        new zi("那", 12, "那", "#00", "a", "/"),
        new zi("ㄅ", 1, "那", "#00", "a", "/"),
    ],
    [
        new zi("他", 5, "他", "#00", "a", "/"),
        new zi("亻", 2, "他", "#00", "a", "/"),
    ],
    [
        new zi("在", 6, "在", "#00", "a", "/"),
        new zi("ナ", 2, "在", "#00", "a", "/"),
    ],
    [
        new zi("再", 6, "再", "#00", "a", "/"),
        new zi("冄", 4, "再", "#00", "a", "/"),
    ],
    [
        new zi("能", 10, "能", "#00", "a", "/"),
        new zi("厸", 4, "能", "#00", "a", "/"),
    ],
    [
        new zi("要", 9, "要", "#00", "a", "/"),
        new zi("ヌ", 2, "要", "#00", "a", "/"),
    ],
    [
        new zi("過", 11, "過", "#00", "a", "/"),
        new zi("ㄋ", 2, "過", "#00", "a", "/"),
    ],
    [
        new zi("從", 11, "從", "#00", "a", "/"),
        new zi("从", 4, "從", "#00", "a", "/"),
    ],
    [
        new zi("們", 10, "們", "#00", "a", "/"),
        new zi("冂", 2, "們", "#00", "a", "/"),
        new zi("们", 5, "們", "#00", "a", "/"),
    ],
    [
        new zi("和", 8, "和", "#00", "a", "/"),
        new zi("丿", 1, "和", "#00", "a", "/"),
    ],
    [
        new zi("裏", 13, "裏", "#00", "a", "/"),
        new zi("亠", 2, "裏", "#00", "a", "/"),
    ],
    [
        new zi("所", 8, "所", "#00", "a", "/"),
        new zi("ㄕ", 3, "所", "#00", "a", "/"),
    ],
    [
        new zi("次", 6, "次", "#00", "a", "/"),
        new zi("ソ", 2, "次", "#00", "a", "/"),
    ],
    [
        new zi("來", 8, "來", "#00", "a", "/"),
        new zi("丯", 4, "來", "#00", "a", "/"),
    ],
    [
        new zi("都", 11, "都", "#00", "a", "/"),
        new zi("耂", 4, "都", "#00", "a", "/"),
    ],
    [
        new zi("像", 13, "像", "#00", "a", "/"),
        new zi("", 2, "像", "#00", "a", "/"),
    ],
    [
        new zi("後", 9, "後", "#00", "a", "/"),
        new zi("乆", 3, "後", "#00", "a", "/"),
    ],
    [
        new zi("沒", 7, "沒", "#00", "a", "/"),
        new zi("氵", 3, "沒", "#00", "a", "/"),
    ],
    [
        new zi("算", 14, "算", "#00", "a", "/"),
        new zi("廾", 3, "算", "#00", "a", "/"),
    ],
    [
        new zi("給", 12, "給", "#00", "a", "/"),
        new zi("亼", 3, "給", "#00", "a", "/"),
    ],
    [
        new zi("點", 17, "點", "#00", "a", "/"),
        new zi("灬", 4, "點", "#00", "a", "/"),
        new zi("点", 9, "點", "#00", "a", "/"),
    ],
    [
        new zi("如", 6, "如", "#00", "a", "/"),
        new zi("ㄣ", 1, "如", "#00", "a", "/"),
    ],
];
export const hanziGroups = hanziGroupList;
export { zi };
//# sourceMappingURL=hanziData.js.map
